tsung-staticPage-concurrent-20000.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
 
  <!-- Client side setup -->
  <clients>
    <!--
    <client host="localhost" use_controller_vm="true" maxusers="100000"/>
    -->
    <client host="tsung0" weight="1" maxusers="40000" cpu="1"/>
    
    <client host="tsung2" weight="2" maxusers="50000" cpu="1"/>
    
    <client host="tsung3" weight="2" maxusers="50000" cpu="1"/>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="54.150.230.6" port="80" type="tcp"></server>
  </servers>
  
  <!--
  <monitoring>
    <monitor host="54.150.230.6" type="snmp"></monitor>
  </monitoring>
  -->

  <load duration="20" unit="minute">
    <arrivalphase phase="1" duration="10" unit="minute">
      <users maxnumber="20000" arrivalrate="200" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
 
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <for from="1" to="10000000"  var="i">
        <request> <http url="/" method="GET" version="1.1"></http> </request>
        <thinktime value="2" random="true"></thinktime>
      </for>
    </session>
  </sessions>
</tsung>