tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
 
  <!-- Client side setup -->
  <clients>
    <!--
    <client host="localhost" use_controller_vm="true" maxusers="100000"/>

    <client host="localhost" weight="1" maxusers="4000" cpu="2">
      <ip value="54.168.81.69"/>
    </client>
    -->
    <client host="loadnode1" weight="1" maxusers="5000" cpu="1">
      <ip value="54.168.103.206"></ip>
    </client>
    
    <client host="loadnode2" weight="1" maxusers="5000" cpu="1">
      <ip value="54.168.35.81"></ip>
    </client>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="54.150.230.6" port="80" type="tcp"></server>
  </servers>
  
  <!--
  <monitoring>
    <monitor host="54.150.230.6" type="snmp"></monitor>
  </monitoring>
  -->

  <load>
    <arrivalphase phase="1" duration="10" unit="minute">
      <users interarrival="0.0625" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
 
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <!--
      <setdynvars sourcetype="random_number" start="1" end="100000000000000000000">
        <var name="fb_rnd" />
      </setdynvars>
      -->
      <!--
      <request> <http url="/standard-platform/api/v1/activityInfo?fb_id=1&amp;activity_id=1" method="GET" version="1.1"></http> </request>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true"> <http url="/standard-platform/api/v1/updateUser?fb_id=%%_fb_rnd%%&amp;fb_token=%%_fb_rnd%%" method="GET" version="1.1" ></http> </request>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true"> <http url="/standard-platform/api/v1/checkInUser?fb_id=%%_fb_rnd%%&amp;activity_id=1&amp;channel_id=1" method="GET" version="1.1" ></http> </request>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true"> <http url="/standard-platform/api/v1/sendEventResult?fb_id=%%_fb_rnd%%&amp;checkIn_id=1&amp;answer=10" method="GET" version="1.1" ></http> </request>
      -->
      <!--
      <for from="1" to="2" incr="1" var="i">
      -->
      <thinktime value="2" random="true"></thinktime>

      <request> <http url="/standard-platform/api/v1/updateUser?fb_id=123321&amp;fb_token=123123" method="GET" version="1.1" ></http> </request>
      <!--
      </for>
      -->
    </session>
  </sessions>
</tsung>