tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
 
  <!-- Client side setup -->
  <clients>
    <client ></client>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server ></server>
  </servers>
  
  <!-- optional -->
  <monitoring>
    <monitor ></monitor>
  </monitoring>

  <loads>
    <arrivalphase ></arrivalphase>
  </loads>
  
  <!-- optional -->
  <options>
    <option ></option>
  </options>
 
  <sessions>
    <session >
      <request ></request>
    </session>
  </sessions>

</tsung>