tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
 
  <!-- Client side setup -->
  <clients>
    <!--
    <client host="localhost" use_controller_vm="true" maxusers="100000"/>
    -->
    
    <client host="loadnode1" weight="1" maxusers="10000" cpu="2">
      <ip value="54.249.131.182"/>
    </client>

    <client host="loadnode2" weight="1" maxusers="10000" cpu="2">
      <ip value="54.168.81.69"/>
    </client>
  </clients>
 
  <!-- Server side setup -->
  <servers>
    <server host="54.150.230.6" port="80" type="tcp"></server>
  </servers>
 
  <monitoring>
    <monitor host="54.150.230.6" type="snmp"></monitor>
  </monitoring>
 
  <load>
    <arrivalphase phase="1" duration="10" unit="minute">
      <users interarrival="0.1" unit="second"></users>
    </arrivalphase>
  </load>
 
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="100000000000000000000">
        <var name="fbint" />
      </setdynvars>
      <for from="1" to="2" incr="1" var="i">
      <!--
      <request subst="true"> <http url="/standard-platform/api/v1/activityInfo?fb_id=%%_fbint%%&amp;activity_id=1" method="GET" version="1.1"></http> </request>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true"> <http url="/standard-platform/api/v1/updateUser?fb_id=%%_fbint%%&amp;fb_token=%%_fbint%%" method="POST" version="1.1" ></http> </request>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true"> <http url="/standard-platform/api/v1/checkInUser?fb_id=%%_fbint%%&amp;activity_id=1&amp;channel_id=1" method="POST" version="1.1" ></http> </request>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true"> <http url="/standard-platform/api/v1/sendEventResult?fb_id=%%_fbint%%&amp;checkIn_id=1&amp;answer=10" method="POST" version="1.1" ></http> </request>
      -->

      <request subst="true"> <http url="/standard-platform/api/v1/updateUser?fb_id=123321&amp;fb_token=123123" method="GET" version="1.1" ></http> </request>
      </for>
    </session>
  </sessions>
</tsung>